Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettingsWarn Property
 SunAndShadowSettings cannot be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopySunAndShadowSettingsWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopySunAndShadowSettingsWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopySunAndShadowSettingsWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace